Revit 2027 API
ExternalServiceId Constructor
Creates a new ExternalServiceId instance.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalServiceId(
	Guid guid
)
Public Sub New (
	guid As Guid
)
public:
ExternalServiceId(
	Guid guid
)
new :
        guid : Guid -> ExternalServiceId
Parameters
guid Guid
The identifier for the ExternalServiceId.
See Also
Reference
ExternalServiceId Class
Autodesk.Revit.DB.ExternalService Namespace